{
  "version": "1.0",
  "description": "Philippine clinical QA evaluation dataset (25 questions) - based on the 17 sample Philippine/WHO clinical PDFs included with KaagapAI for demo and evaluation",
  "questions": [
    {
      "id": "q001",
      "query": "What is the DOTS protocol for drug-susceptible pulmonary TB?",
      "ground_truth": "The DOH NTP DOTS protocol for drug-susceptible pulmonary TB consists of an intensive phase of 2 months (RHZE: rifampicin, isoniazid, pyrazinamide, ethambutol daily) followed by a continuation phase of 4 months (RH: rifampicin and isoniazid daily). All doses must be directly observed by a trained treatment partner.",
      "expected_sources": ["PH TB NTP Manual of Procedures 6th Edition"],
      "category": "tuberculosis",
      "difficulty": "easy"
    },
    {
      "id": "q002",
      "query": "How should a new TB patient with concurrent diabetes be managed?",
      "ground_truth": "TB-DM patients receive the standard 6-month DOTS regimen (2RHZE/4RH) but require closer monitoring: monthly sputum examinations, blood glucose monitoring at baseline and monthly, and coordination between TB-DOTS and diabetes clinics. Rifampicin may reduce the effectiveness of oral hypoglycemics, requiring dose adjustments.",
      "expected_sources": ["PH TB NTP Manual of Procedures 6th Edition"],
      "category": "tuberculosis",
      "difficulty": "medium"
    },
    {
      "id": "q003",
      "query": "What are the diagnostic criteria for TB in a presumptive TB patient at an RHU?",
      "ground_truth": "At the RHU level, presumptive TB patients undergo sputum smear microscopy (two specimens: spot and early morning). A patient is bacteriologically confirmed if at least one specimen is smear-positive for acid-fast bacilli. GeneXpert MTB/RIF is recommended as the initial diagnostic test where available, especially for retreatment cases, children, and PLHIV.",
      "expected_sources": ["PH TB NTP Manual of Procedures 6th Edition"],
      "category": "tuberculosis",
      "difficulty": "easy"
    },
    {
      "id": "q004",
      "query": "What is the standard regimen for drug-resistant TB in the Philippines?",
      "ground_truth": "For rifampicin-resistant or MDR-TB, the NTP recommends the shorter standardized regimen (9-11 months) or the longer individualized regimen (18-20 months) based on drug susceptibility testing. The shorter regimen includes an intensive phase with bedaquiline, linezolid, levofloxacin, clofazimine, and pyrazinamide, followed by a continuation phase.",
      "expected_sources": ["PH TB NTP Manual of Procedures 6th Edition"],
      "category": "tuberculosis",
      "difficulty": "hard"
    },
    {
      "id": "q005",
      "query": "How should TB contacts be managed at the community level?",
      "ground_truth": "All household contacts of bacteriologically confirmed TB patients must be screened. Symptomatic contacts undergo sputum examination. Children under 5 who are contacts of smear-positive cases should receive TB preventive therapy (TPT) with isoniazid for 6 months if active TB is excluded. Contact tracing and screening are done by barangay health workers under supervision of the RHU.",
      "expected_sources": ["PH TB NTP Manual of Procedures 6th Edition"],
      "category": "tuberculosis",
      "difficulty": "medium"
    },
    {
      "id": "q006",
      "query": "What are the dengue warning signs that require hospitalization in children?",
      "ground_truth": "Dengue warning signs requiring hospitalization include: abdominal pain or tenderness, persistent vomiting (3 or more episodes in 24 hours), clinical fluid accumulation (pleural effusion, ascites), mucosal bleeding, lethargy or restlessness, liver enlargement >2 cm, and rising hematocrit concurrent with rapid decrease in platelet count. Any patient with one or more warning signs requires hospital admission for close monitoring.",
      "expected_sources": ["PH Dengue CPG 2017"],
      "category": "dengue",
      "difficulty": "easy"
    },
    {
      "id": "q007",
      "query": "What is the recommended fluid management for dengue with warning signs?",
      "ground_truth": "For dengue with warning signs, start isotonic crystalloid solution (0.9% NaCl or Lactated Ringer's) at 5-7 mL/kg/hour for 1-2 hours, then reduce to 3-5 mL/kg/hour for 2-4 hours, then 2-3 mL/kg/hour based on clinical response. Monitor hematocrit before and after fluid boluses. Reduce IV fluids when hematocrit decreases, urine output improves, and vital signs stabilize.",
      "expected_sources": ["PH Dengue CPG 2017"],
      "category": "dengue",
      "difficulty": "medium"
    },
    {
      "id": "q008",
      "query": "When should platelet transfusion be given in dengue?",
      "ground_truth": "Prophylactic platelet transfusion is NOT recommended in dengue regardless of platelet count. Platelet transfusion should only be considered in cases of significant clinical bleeding that is uncontrolled. A low platelet count alone is not an indication for transfusion. The focus should be on maintaining adequate fluid resuscitation and monitoring for bleeding.",
      "expected_sources": ["PH Dengue CPG 2017"],
      "category": "dengue",
      "difficulty": "medium"
    },
    {
      "id": "q009",
      "query": "How is dengue classified by severity?",
      "ground_truth": "The WHO/PIDSP classification divides dengue into three categories: (1) Dengue without warning signs — fever with two or more of nausea/vomiting, rash, aches, leukopenia, positive tourniquet test; (2) Dengue with warning signs — abdominal pain, persistent vomiting, fluid accumulation, mucosal bleeding, lethargy, hepatomegaly, rising hematocrit with dropping platelets; (3) Severe dengue — severe plasma leakage leading to shock or fluid accumulation with respiratory distress, severe bleeding, or severe organ impairment.",
      "expected_sources": ["PH Dengue CPG 2017"],
      "category": "dengue",
      "difficulty": "easy"
    },
    {
      "id": "q010",
      "query": "What is the first-line antihypertensive drug recommended by the Philippine Hypertension CPG?",
      "ground_truth": "The Philippine CPG on Hypertension recommends any of the five major drug classes as first-line therapy: ACE inhibitors, ARBs, calcium channel blockers (CCBs), thiazide diuretics, or beta-blockers. For uncomplicated hypertension, CCBs (amlodipine) or ARBs (losartan) are preferred as initial monotherapy. The choice depends on compelling indications, comorbidities, and drug availability.",
      "expected_sources": ["PH Hypertension CPG 2020"],
      "category": "hypertension",
      "difficulty": "easy"
    },
    {
      "id": "q011",
      "query": "What are the blood pressure targets for hypertensive Filipino patients with diabetes?",
      "ground_truth": "For hypertensive patients with diabetes, the Philippine CPG recommends a target blood pressure of <130/80 mmHg. An ACE inhibitor or ARB is the preferred first-line agent due to renoprotective effects. Combination therapy is usually required, and a CCB or thiazide diuretic can be added as second-line. Lifestyle modifications including dietary sodium restriction and weight management are integral.",
      "expected_sources": ["PH Hypertension CPG 2020"],
      "category": "hypertension",
      "difficulty": "medium"
    },
    {
      "id": "q012",
      "query": "How should hypertensive urgency be managed at the RHU level?",
      "ground_truth": "Hypertensive urgency (severely elevated BP >180/120 mmHg without acute target organ damage) should be managed with oral antihypertensives. Oral amlodipine 5-10 mg or captopril 25 mg sublingual can be given. The goal is to reduce BP gradually over 24-48 hours, not acutely. The patient should be observed for 2-6 hours at the RHU. Referral to a higher-level facility is indicated if BP does not respond or if symptoms of target organ damage develop.",
      "expected_sources": ["PH Hypertension CPG 2020"],
      "category": "hypertension",
      "difficulty": "medium"
    },
    {
      "id": "q013",
      "query": "What is the screening protocol for Type 2 diabetes in the Philippines?",
      "ground_truth": "The Philippine UNITE CPG recommends screening for Type 2 DM in all adults aged 40 and above, and in younger adults with risk factors: BMI >= 23 kg/m2, family history of diabetes, history of gestational diabetes, hypertension, dyslipidemia, or polycystic ovary syndrome. Screening is done with fasting blood sugar (FBS). Diabetes is diagnosed with FBS >= 126 mg/dL (confirmed on repeat), random blood sugar >= 200 mg/dL with symptoms, or HbA1c >= 6.5%.",
      "expected_sources": ["PH Diabetes UNITE CPG"],
      "category": "diabetes",
      "difficulty": "easy"
    },
    {
      "id": "q014",
      "query": "What is the recommended first-line drug for newly diagnosed Type 2 diabetes?",
      "ground_truth": "Metformin is the recommended first-line pharmacologic therapy for newly diagnosed Type 2 DM, starting at 500 mg once daily with meals, titrated to 500 mg twice daily after 1-2 weeks, up to a maximum of 2000 mg/day. It is preferred due to its efficacy, weight neutrality, low hypoglycemia risk, and low cost. Metformin is contraindicated in patients with eGFR <30 mL/min or in conditions predisposing to lactic acidosis.",
      "expected_sources": ["PH Diabetes UNITE CPG"],
      "category": "diabetes",
      "difficulty": "easy"
    },
    {
      "id": "q015",
      "query": "What are the HbA1c targets for Filipino diabetic patients?",
      "ground_truth": "The UNITE CPG recommends an HbA1c target of <7.0% for most adult patients with Type 2 DM. A more stringent target of <6.5% may be considered for newly diagnosed patients without significant comorbidities. A less stringent target of <8.0% is acceptable for elderly patients, those with long disease duration, limited life expectancy, or significant comorbidities where the risk of hypoglycemia outweighs the benefit of tight control.",
      "expected_sources": ["PH Diabetes UNITE CPG"],
      "category": "diabetes",
      "difficulty": "medium"
    },
    {
      "id": "q016",
      "query": "What is the empiric antibiotic for low-risk community-acquired pneumonia in adults?",
      "ground_truth": "For low-risk (outpatient) community-acquired pneumonia in adults, the PSMID CPG recommends amoxicillin 1g three times daily for 5-7 days as first-line. For penicillin-allergic patients or atypical coverage, azithromycin 500 mg on day 1 then 250 mg daily for 4 more days, or doxycycline 100 mg twice daily for 7 days. Co-amoxiclav 625 mg three times daily is an alternative if there are comorbidities.",
      "expected_sources": ["PH CAP Adults CPG 2016"],
      "category": "pneumonia",
      "difficulty": "easy"
    },
    {
      "id": "q017",
      "query": "How is the severity of community-acquired pneumonia assessed in the Philippine setting?",
      "ground_truth": "The PSMID CPG recommends using the CRB-65 score for outpatient settings (no lab needed): Confusion, Respiratory rate >= 30, Blood pressure (systolic <90 or diastolic <= 60), and age >= 65. Score 0: outpatient treatment. Score 1-2: consider hospital admission. Score 3-4: urgent hospital admission, assess for ICU. The CURB-65 score (adds BUN > 7 mmol/L) is used in hospitals where labs are available.",
      "expected_sources": ["PH CAP Adults CPG 2016"],
      "category": "pneumonia",
      "difficulty": "medium"
    },
    {
      "id": "q018",
      "query": "What is the recommended prophylaxis for leptospirosis during flooding?",
      "ground_truth": "Doxycycline 200 mg given once weekly is recommended as chemoprophylaxis for leptospirosis during flooding or high-risk exposure in endemic areas. Prophylaxis should begin before exposure if possible and continued weekly during the exposure period. It is contraindicated in pregnant women and children under 8 years. For these groups, azithromycin may be considered as an alternative.",
      "expected_sources": ["PH Leptospirosis CPG 2010"],
      "category": "leptospirosis",
      "difficulty": "easy"
    },
    {
      "id": "q019",
      "query": "What are the clinical features and initial management of leptospirosis?",
      "ground_truth": "Leptospirosis presents with sudden onset of high fever, severe headache, myalgia (especially calf muscles), conjunctival suffusion, and jaundice in severe cases. Initial management: for mild cases, oral doxycycline 100 mg twice daily or amoxicillin 500 mg three times daily for 7 days. For severe cases (Weil disease with jaundice, renal failure, hemorrhage), IV penicillin G 1.5 million units every 6 hours or ceftriaxone 1g IV daily. Supportive care with fluid resuscitation and monitoring of renal and hepatic function.",
      "expected_sources": ["PH Leptospirosis CPG 2010"],
      "category": "leptospirosis",
      "difficulty": "medium"
    },
    {
      "id": "q020",
      "query": "What are the components of Basic Emergency Obstetric and Newborn Care (BEmONC)?",
      "ground_truth": "The DOH MNCHN strategy defines BEmONC signal functions that must be available at RHUs: (1) parenteral antibiotics, (2) parenteral oxytocics (oxytocin for PPH prevention and management), (3) parenteral anticonvulsants (magnesium sulfate for eclampsia), (4) manual removal of placenta, (5) removal of retained products, (6) assisted vaginal delivery (vacuum extraction), and (7) newborn resuscitation with bag and mask. All RHUs and lying-in clinics are expected to provide these 7 signal functions 24/7.",
      "expected_sources": ["PH MNCHN Strategy MOP"],
      "category": "maternal_health",
      "difficulty": "medium"
    },
    {
      "id": "q021",
      "query": "What is the recommended antenatal care schedule per DOH guidelines?",
      "ground_truth": "The DOH MNCHN guidelines recommend a minimum of 4 focused ANC visits: first visit as early as possible in the 1st trimester, second visit at 24-28 weeks, third visit at 32 weeks, and fourth visit at 36-38 weeks. Each visit includes BP monitoring, weight check, fundal height measurement, fetal heart rate assessment, urine testing for protein and glucose, hemoglobin determination, and screening for syphilis and HIV. Iron and folic acid supplementation should be provided throughout pregnancy.",
      "expected_sources": ["PH MNCHN Strategy MOP"],
      "category": "maternal_health",
      "difficulty": "easy"
    },
    {
      "id": "q022",
      "query": "What is the Philippine EPI immunization schedule for infants?",
      "ground_truth": "The PIDSP/DOH Expanded Programme on Immunization schedule: BCG at birth; Hepatitis B within 24 hours of birth; Pentavalent (DPT-HepB-Hib) at 6, 10, and 14 weeks; OPV at 6, 10, and 14 weeks; IPV at 14 weeks; PCV at 6, 10, and 14 weeks; MMR at 9 and 12 months; Japanese Encephalitis at 9 months. All EPI vaccines are provided free at government health facilities including RHUs and barangay health stations.",
      "expected_sources": ["PH Immunization Schedule 2024"],
      "category": "immunization",
      "difficulty": "easy"
    },
    {
      "id": "q023",
      "query": "What is the catch-up vaccination protocol for children who missed their scheduled vaccines?",
      "ground_truth": "For children who missed scheduled vaccinations, the PIDSP recommends catch-up vaccination at the earliest opportunity. Key principles: there is no need to restart a series regardless of the interval since the last dose; minimum intervals between doses must be observed; multiple vaccines can be given simultaneously at different injection sites. For children starting late, give all age-appropriate vaccines at the first visit and schedule subsequent doses at minimum intervals.",
      "expected_sources": ["PH Immunization Schedule 2024"],
      "category": "immunization",
      "difficulty": "medium"
    },
    {
      "id": "q024",
      "query": "What essential medicines should be available at Rural Health Units?",
      "ground_truth": "Per the Philippine National Formulary for Primary Healthcare, RHUs must maintain essential medicines including: amoxicillin, co-amoxiclav, metronidazole, cotrimoxazole (antibiotics); paracetamol, ibuprofen, mefenamic acid (analgesics); amlodipine, losartan, hydrochlorothiazide (antihypertensives); metformin, glibenclamide (antidiabetics); salbutamol nebule and MDI (respiratory); oral rehydration salts, zinc sulfate (diarrheal disease); oxytocin (obstetric); and ferrous sulfate plus folic acid (nutritional supplements).",
      "expected_sources": ["PH Formulary Primary Healthcare"],
      "category": "essential_medicines",
      "difficulty": "easy"
    },
    {
      "id": "q025",
      "query": "Which drugs are on the Philippine National Formulary Essential Medicines List for infectious diseases?",
      "ground_truth": "The PNF Essential Medicines List includes key infectious disease drugs: amoxicillin, ampicillin, co-amoxiclav, azithromycin, ceftriaxone, doxycycline, metronidazole, ciprofloxacin (antibacterials); isoniazid, rifampicin, pyrazinamide, ethambutol, streptomycin (anti-TB); chloroquine, primaquine, artemether-lumefantrine (antimalarials); fluconazole (antifungal); albendazole, mebendazole (antihelminthics); and acyclovir, oseltamivir (antivirals). These are prioritized for procurement by government health facilities through PhilHealth reimbursement.",
      "expected_sources": ["PH National Formulary EML 2022"],
      "category": "essential_medicines",
      "difficulty": "medium"
    }
  ]
}
